export function transliterateToUrl(str: string): string {
  const mapping: { [key: string]: string } = {
    а: "a",
    б: "b",
    в: "v",
    г: "g",
    д: "d",
    е: "e",
    ё: "yo",
    ж: "zh",
    з: "z",
    и: "i",
    й: "y",
    к: "k",
    л: "l",
    м: "m",
    н: "n",
    о: "o",
    п: "p",
    р: "r",
    с: "s",
    т: "t",
    у: "u",
    ф: "f",
    х: "kh",
    ц: "ts",
    ч: "ch",
    ш: "sh",
    щ: "sch",
    ы: "y",
    э: "e",
    ю: "yu",
    я: "ya",
    " ": "-",
    "1": "1",
    "2": "2",
    "3": "3",
    "4": "4",
    "5": "5",
    "6": "6",
    "7": "7",
    "8": "8",
    "9": "9",
    "0": "0",
    "+": "plus", // Замена плюс на "plus"
    "&": "and", // Замена амперсанда на "and"
    "%": "percent", // Замена процента на "percent"
    "#": "hash", // Замена решетки на "hash"
    "@": "at", // Замена собачки на "at"
    "=": "equals", // Замена равенства на "equals"
  };

  return str
    .split("") // Разделяем строку на массив символов
    .map((char) => mapping[char.toLowerCase()] || char) // Применяем транслитерацию
    .join("") // Собираем обратно в строку
    .toLowerCase() // Приводим к нижнему регистру
    .replace(/[^a-z0-9\-]/g, "") // Удаляем все символы, кроме латинских букв, цифр и дефисов
    .replace(/--+/g, "-") // Удаляем повторяющиеся дефисы
    .replace(/^-|-$/g, ""); // Убираем дефисы в начале и в конце строки
}
